# Find a person with the second-highest salary

In [ ]:
/*
Solution: uses window function
PostgreSQL
*/
WITH temp1 AS (
	SELECT 'John' name, 200000 salary
	UNION ALL 
	SELECT 'Jack_secondhighest' name, 160000 salary
	UNION ALL
	SELECT 'Rich' name, 150000 salary
	UNION ALL
	SELECT 'Boris' name, 110000 salary
), 

ranks AS (
	SELECT 
		name,
		salary,
		ROW_NUMBER() OVER (ORDER BY salary DESC) AS rank_salary
	FROM temp1
)

SELECT 
	name, 
	salary
FROM ranks 
WHERE rank_salary = 2

In [ ]:
/*
Solution: uses window function
BigQuery, MySQL (NOT PostgreSQL)
*/
WITH temp1 AS (
	SELECT 'John' name, 200000 salary
	UNION ALL 
	SELECT 'Jack_secondhighest' name, 160000 salary
	UNION ALL
	SELECT 'Rich' name, 150000 salary
	UNION ALL
	SELECT 'Boris' name, 110000 salary
)

SELECT 
	name,
	salary
FROM temp1
QUALIFY ROW_NUMBER() OVER (ORDER BY salary DESC) = 2

In [ ]:
/*
Solution: uses max
Any SQL
*/
WITH temp1 AS (
	SELECT 'John' name, 200000 salary
	UNION ALL 
	SELECT 'Jack_secondhighest' name, 160000 salary
	UNION ALL
	SELECT 'Rich' name, 150000 salary
	UNION ALL
	SELECT 'Boris' name, 110000 salary
)

SELECT *
FROM temp1 
WHERE salary <> (SELECT MAX(salary) FROM temp1)
ORDER BY salary DESC
LIMIT 1